TestJMeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="TestJMeter" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">12</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">44389</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/doohlink/screen/ad16f9e2-bf39-43cf-af69-47b7388ee9cd</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsImtpZCI6IkJEMzAzNUY3ODFBNDU5NzQ5ODUyQzZENEI2NTRDRjA4REY4MzVDM0IiLCJ4NXQiOiJ2VEExOTRHa1dYU1lVc2JVdGxUUENOLURYRHMiLCJ0eXAiOiJhdCtqd3QifQ.eyJzdWIiOiIzYTBhYThhNC1iYWRjLWI1ZjktMTE2Zi03MTdiYWY5MTdmMzUiLCJwcmVmZXJyZWRfdXNlcm5hbWUiOiJhZG1pbiIsImVtYWlsIjoiY2FuQHRyaWJ1bHVzZGV2ZWxvcG1lbnQuY29tIiwicm9sZSI6ImFkbWluIiwidGVuYW50aWQiOiIzYTBhYThhNC1hZjViLWE5MGEtMmI2Zi0zMDkwZjI3YWE3MmYiLCJnaXZlbl9uYW1lIjoiYWRtaW4iLCJwaG9uZV9udW1iZXJfdmVyaWZpZWQiOiJGYWxzZSIsImVtYWlsX3ZlcmlmaWVkIjoiRmFsc2UiLCJ1bmlxdWVfbmFtZSI6ImFkbWluIiwib2lfcHJzdCI6IkRvb2hsaW5rX0FwcCIsImlzcyI6Imh0dHBzOi8vbG9jYWxob3N0OjQ0MzY0LyIsIm9pX2F1X2lkIjoiM2EwYWE4YWMtOGVjMy1iMWIwLWYzOTctMTM0ZmEyY2MyN2U1IiwiY2xpZW50X2lkIjoiRG9vaGxpbmtfQXBwIiwib2lfdGtuX2lkIjoiM2EwYWE4YWMtZmM1NS03MzEwLTc0OTQtMjZlY2ZjMjBiMzg5IiwiYXVkIjoiRG9vaGxpbmsiLCJzY29wZSI6Im9wZW5pZCBvZmZsaW5lX2FjY2VzcyBEb29obGluayIsImp0aSI6ImY1OGEzZjFlLWYzOTctNGM4My04Y2JmLWEzMWMzZjI2ZGZjOSIsImV4cCI6MTY4MTg2MDc5MywiaWF0IjoxNjgxODU3MTkzfQ.MGQui5OqAV8gtpF73Glgaan_Yr1KUxglLLlgvhm-YefN212LsiIGdAS6He6a40WOLpGccdf5DYtM1xKWnhAAnr4Hm0cnWnWfl5xRzwubUR7iXZ8m8YfpwNU-bNNj-Lu66X6dcGu9WYN4g8mWWkc2YKGpL51c7MTm0MRdjUCPjspf0Z4soO6BAVSZDap0YWeV9_UAW7Yl3b9AxYxJdU8PVYJxd2wLHYVxvLUC5PCnktYRQJvNKJNWZ0H0tsajJt0yRh_aceU5hvtR1pI4VUxN4CYExGX8JQBcuqZJAWMi8iBKnacbddTsb7p37yK8K0sWKqgHtKsjdIFfB8ZuGRuf6g</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">__tenant</stringProp>
                <stringProp name="Header.value">3a0aa8a4-af5b-a90a-2b6f-3090f27aa72f</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">accept-language</stringProp>
                <stringProp name="Header.value">en</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>